manageme1/ElectricPowerSteering_TMS570_PSA_CMP/Fls/include/Registers_FMC_LE.h
  uint32_t _Reserved_D8_DC[2];/* Reserved Address Locations 0xD8-0xDC */
 
  /*!
       Defines whole and bit level accesses to the JSM Key0  - 0xE0
   */
   union JSMKEY0
   {
      uint32_t u32Register; /* Bank Addr Register, bits 31:0 */
   } JSMKey0;
 
	/*!
       Defines whole and bit level accesses to the JSM Key1  - 0xE4
   */
   union JSMKEY1
   {
      uint32_t u32Register; /* Bank Addr Register, bits 31:0 */
   } JSMKey1;
   
   
   /*!
       Defines whole and bit level accesses to the JSM Key2  - 0xE8
   */
   union JSMKEY2
   {
      uint32_t u32Register; /* Bank Addr Register, bits 31:0 */
   } JSMKey2;
   
   
   /*!
       Defines whole and bit level accesses to the JSM Key3  - 0xEC
   */
   union JSMKEY3
   {
      uint32_t u32Register; /* Bank Addr Register, bits 31:0 */
   } JSMKey3;
 
	 uint32_t _Reserved_F0_10C[8];/* Reserved Address Locations 0xF0 - 0x10C */


   /*!
       Defines whole and bit level accesses to the Bank Addr Register - 0x110
   */
   union FADDR
   {
      uint32_t u32Register; /* Bank Addr Register, bits 31:0 */
   } Faddr;
 
    uint32_t _Reserved_114_118[2]; /* Reserved Address Locations 0x114-0x118 */

   union FTCTRL
      {
         uint32_t u32Register; /* Error Detection Sector Disable Register, bits 31:0 */
         struct
         {
            uint32_t  Reserved_23_00 :24;
			uint32_t  AutoCalc_EN    :1;/*!< Sector ID3 Inverse, bits 29:24 */
			uint32_t  Reserved_31_30 :7;/*!< Reserved bits, 31:30 */
         } FTCTRL_BITS;
      } Ftctrl;

   /*!
       Defines whole and bit level accesses to the FWPWRITE0 Register - 0x120
   */
   union FWPWRITE0
   {
      uint32_t u32Register; /* FWPWRITE0 Register, bits 31:0 */
   } Fwpwrite0;

   /*!
       Defines whole and bit level accesses to the FWPWRITE1 Register - 0x124
   */
   union FWPWRITE1
   {
      uint32_t u32Register; /* FWPWRITE1 Register, bits 31:0 */
   } Fwpwrite1;

   /*!
       Defines whole and bit level accesses to the FWPWRITE2 Register - 0x128
   */
   union FWPWRITE2
   {
      uint32_t u32Register; /* FWPWRITE2 Register, bits 31:0 */
   } Fwpwrite2;

   /*!
       Defines whole and bit level accesses to the FWPWRITE3 Register - 0x12C
   */
   union FWPWRITE3
   {
      uint32_t u32Register; /* FWPWRITE3 Register, bits 31:0 */
   } Fwpwrite3;

   /*!
       Defines whole and bit level accesses to the FWPWRITE4 Register - 0x130
   */
   union FWPWRITE4
   {
      uint32_t u32Register; /* FWPWRITE4 Register, bits 31:0 */
   } Fwpwrite4;

   /*!
       Defines whole and bit level accesses to the FWPWRITE5 Register - 0x134
   */
   union FWPWRITE5
   {
      uint32_t u32Register; /* FWPWRITE5 Register, bits 31:0 */
   } Fwpwrite5;

   /*!
       Defines whole and bit level accesses to the FWPWRITE6 Register - 0x138
   */
   union FWPWRITE6
   {
      uint32_t u32Register; /* FWPWRITE6 Register, bits 31:0 */
   } Fwpwrite6;

   /*!
       Defines whole and bit level accesses to the FWPWRITE7 Register - 0x13C
   */
   union FWPWRITE7
   {
      uint32_t u32Register; /* FWPWRITE7 Register, bits 31:0 */
   } Fwpwrite7;
   
   /*!
       Defines whole and bit level accesses to the FWPWRITE_ECC Register - 0x140
   */
   union FWPWRITE_ECC
   {
      uint32_t u32Register; /* FWPWRITE_ECC Register, bits 31:0 */
      struct
      {
        uint32_t WPDATA_287_256; /*!< WPDATA[287:256], bits 31:0 */
      } FWPWRITE_ECC_BITS;
      struct
      {
        uint32_t u8Bytes31_24:8;
		uint32_t u8Bytes23_16:8;
		uint32_t u8Bytes15_08:8;
		uint32_t u8Bytes07_00:8;
      } FWPWRITE_ECC_BYTES;
   } FwpwriteEcc;

   uint32_t _Reserved_144_208[50]; /* Reserved Address Locations 0x144-0x208 */

   /*!
       Defines whole and bit level accesses to the FSM Command Register - 0x20C
   */
   union FSM_COMMAND
   {
      uint32_t u32Register; /* FSM Command, bits 31:0 */
      struct
      {
        uint32_t  FSMCMD                     :6; /*!< Flash State Machine Command, bits 5:0 */
		uint32_t _FSM_COMMAND_Reserved_31_06 :26;/*!< Reserved, bits 31:6 */
      } FSM_COMMAND_BITS;
   } FsmCommand;

   uint32_t _Reserved_210_284[30]; /* Reserved Address Locations 0x210-0x284 */

   /*!
       Defines whole and bit level accesses to the FSM Register Write Enable- 0x288
   */
   union FSM_WR_ENA
   {
      uint32_t u32Register; /* FSM Register Write Enable, bits 31:0 */
      struct
      {
        uint32_t  WR_ENA                    :3; /*!< FSM Write Enable, bits 2:0 */
		uint32_t _FSM_WR_ENA_Reserved_31_03 :29;/*!< Reserved, bits 31:3 */
      } FSM_WR_ENA_BITS;
   } FsmWrEna;

   uint32_t _Reserved_28C_2A0[6]; /* Reserved Address Locations 0x28C-0x2A0 */

   /*!
       Defines whole and bit level accesses to the FSM Sector Register - 0x2A4
   */
   union FSM_SECTOR
   {
      uint32_t u32Register; /* FSM Sector, bits 31:0 */
      struct
      {
        uint32_t SEC_OUT		:4; /*!< Sector from Address decoder, bits 3:0 */
		uint32_t SECTOR		 	:4; /*!< Current sector used by FSM, bits 7:4 */
		uint32_t FLEE_SECT_ETXN :8; /*!< FLEE Sector Extension bits, bits 15:8 */
		uint32_t SECT_ERASED    :16;/*!< Sectors Erased, bits 31:16 */
      } FSM_SECTOR_BITS;
   } FsmSector;
   
    uint32_t _Reserved_2A8_2B0[3]; /* Reserved Address Locations 0x2A8-0x2B0 */

   
   /*!
       Defines whole and bit level accesses to the FSM Command Execute Register - 0x2B4
   */
   union FSM_EXECUTE
   {
      uint32_t u32Register; /* FSM Command Execute, bits 31:0 */
      struct
      {
        uint32_t  FSMEXECUTE                 :5; /*!< FSM Command Execute, bits 4:0 */
		uint32_t _FSM_EXECUTE_Reserved_15_05 :11;/*!< Reserved, bits 15:5 */
		uint32_t  SUSPEND_NOW                :4; /*!< FSM Command Suspend, bits 19:16 */
		uint32_t _FSM_EXECUTE_Reserved_31_20 :12;/*!< Reserved, bits 31:20 */
      } FSM_EXECUTE_BITS;
   } FsmExecute;

    /*!
       Defines whole and bit level accesses to the EEPROM Emulation configuration Register - 0x2B8
   */
   union EEPROM_CONFIG
   {
      uint32_t u32Register; /* EEPROM Emulation configuration, bits 31:0 */
      struct
      {
        uint32_t  _EEPROM_CONFIG_Reserved_15_00 :16;/*!< Reserved, bits 15:0 */
		uint32_t  EWAIT                         :4; /*!< EEPROM Wait state Counter, bits 19:16 */
		uint32_t _EEPROM_CONFIG_Reserved_31_20 	:12;/*!< Reserved, bits 31:20 */
      } EEPROM_CONFIG_BITS;
   } EepromConfig;

